

Процедура ПередПодключением(Клиент)	
	ЗаписьЖурналаРегистрации("WebSocket.ПередПодключением",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.WebSocketКлиенты.WS_КлиентРасширение);	
КонецПроцедуры

Процедура ПриОткрытииСоединения(Соединение)	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОткрытииСоединения",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.WebSocketКлиенты.WS_КлиентРасширение);
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение)	
	ЗаписьЖурналаРегистрации("WebSocket.ПриПолученииСообщения",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.WebSocketКлиенты.WS_КлиентРасширение,,Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОшибке",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.WebSocketКлиенты.WS_КлиентРасширение,КодОшибки,Описание);			
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	ЗаписьЖурналаРегистрации("WebSocket.ПриЗакрытииСоединения",
		УровеньЖурналаРегистрации.Предупреждение,
		Метаданные.WebSocketКлиенты.WS_КлиентРасширение,КодЗакрытия);	
КонецПроцедуры
