
Процедура ПередПодключением(Клиент)
	ВебСокетыКлиентСервер.ПередПодключением(Клиент); 
КонецПроцедуры

Процедура ПриОткрытииСоединения(Соединение)
	ВебСокетыКлиентСервер.ПриОткрытииСоединения(Соединение);   
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение)
	ВебСокетыКлиентСервер.ПриПолученииСообщения(Соединение, Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)
	ВебСокетыКлиентСервер.ПриОшибке(Соединение, КодОшибки, Описание);
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	ВебСокетыКлиентСервер.ПриЗакрытииСоединения(Соединение, КодЗакрытия);
КонецПроцедуры
