
Процедура ПередПодключением(Клиент)
	// Вставить содержимое обработчика.
	//Клиент.ПараметрыСоединения.Заголовки["x-token"] = "secret123";
КонецПроцедуры


Процедура ПриОткрытииСоединения(Соединение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	// Вставить содержимое обработчика.
КонецПроцедуры


