
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработчикиСокета = Новый ОбработчикиWebSocketКлиентСоединения;
	ОбработчикиСокета.Модуль = ЭтотОбъект;
    ОбработчикиСокета.ОбработчикОткрытияСоединения = "ВебСокет_ОбработчикОткрытия";
    ОбработчикиСокета.ОбработчикЗакрытияСоединения= "ВебСокет_ОбработчикЗакрытия";
    ОбработчикиСокета.ОбработчикПолученияСообщения = "ВебСокет_ОбработчикПолученияСообщения";
    ОбработчикиСокета.ОбработчикОшибки = "ВебСокет_ОбработчикОшибки";
	
    WebSocketКлиентСоединения.ОткрытьСоединение("ws_localhost_3001", "ws://localhost:3001", ОбработчикиСокета,,"Администратор");

КонецПроцедуры

&НаКлиенте
Процедура ВебСокет_ОбработчикОткрытия(Соединение) Экспорт 
	
	СтруктураСоединение = ВебСокетыКлиент.ПараметрыСоединения(Соединение);   
	
	СоединениеJSON = ВебСокетыСервер.ЗаписатьДанныеВJSON(,СтруктураСоединение).Результат;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Соединение", СоединениеJSON);

	ВебСокетыСервер.ПриОткрытииСоединения(Соединение.Ключ, ПараметрыЗаписи);  	
	
КонецПроцедуры  

&НаКлиенте
Процедура ВебСокет_ОбработчикПолученияСообщения(Соединение, Сообщение) Экспорт
	
	НоваяСтрока = Общение.Добавить();
	НоваяСтрока.ТекстСообщения = Сообщение;

	СтруктураСоединение = ВебСокетыКлиент.ПараметрыСоединения(Соединение); 
	СоединениеJSON = ВебСокетыСервер.ЗаписатьДанныеВJSON(,СтруктураСоединение).Результат;
	
	ПараметрыЗаписи = Новый Структура;	
	ПараметрыЗаписи.Вставить("Соединение", СоединениеJSON);
	ПараметрыЗаписи.Вставить("Сообщение",	Сообщение);

    ВебСокетыСервер.ПриПолученииСообщения(Соединение.Ключ, ПараметрыЗаписи);   
	
КонецПроцедуры 

&НаКлиенте
Процедура ВебСокет_ОбработчикОшибки(Соединение, КодОшибки, Описание) Экспорт
	
	СтруктураСоединение = ВебСокетыКлиент.ПараметрыСоединения(Соединение); 
	СоединениеJSON = ВебСокетыСервер.ЗаписатьДанныеВJSON(,СтруктураСоединение).Результат;
	
	ПараметрыЗаписи = Новый Структура;	
	ПараметрыЗаписи.Вставить("Соединение", СоединениеJSON); 
	ПараметрыЗаписи.Вставить("Код",КодОшибки);
	ПараметрыЗаписи.Вставить("Описание",Описание);
	
	ВебСокетыСервер.ПриОшибке(Соединение.Ключ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВебСокет_ОбработчикЗакрытия(Соединение, КодЗакрытия) Экспорт
	
	СтруктураСоединение = ВебСокетыКлиент.ПараметрыСоединения(Соединение); 
	СоединениеJSON = ВебСокетыСервер.ЗаписатьДанныеВJSON(,СтруктураСоединение).Результат;
	
	ПараметрыЗаписи = Новый Структура;	
	ПараметрыЗаписи.Вставить("Соединение", СоединениеJSON);  
	ПараметрыЗаписи.Вставить("Код",КодЗакрытия);
	
	ВебСокетыСервер.ПриЗакрытииСоединения(Соединение, ПараметрыЗаписи); 
		
	ВидимостьДоступностьЭлементов(Ложь);
	
КонецПроцедуры  

&НаКлиенте
Процедура Зарегистрироваться(Команда)

	
	ВебСокет = WebSocketКлиентСоединения.ПолучитьСоединение("ws_localhost_3001");
	
	СтруктураРегистрации = Новый Структура("type,id","register",ИмяКлиента);
	ТекстСообщения = ВебСокетыСервер.ЗаписатьДанныеВJSON(,СтруктураРегистрации).Результат;
	
	СостояниеСоединения = ВебСокет.ПолучитьСостояние();
	СостояниеОткрыто = (СостояниеСоединения = СостояниеWebSocketСоединения.Открыто);	
	
	Если СостояниеОткрыто Тогда 
		// отправка данных в WebSocket
		ВебСокет.ОтправитьСообщение(ТекстСообщения);
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;	
	ПараметрыЗаписи.Вставить("Сообщение", ТекстСообщения);  
	
	ВебСокетыСервер.ПриЗакрытииСоединения("ws_localhost_3001", ПараметрыЗаписи);
		
	ВидимостьДоступностьЭлементов(СостояниеОткрыто);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	ВебСокет = WebSocketКлиентСоединения.ПолучитьСоединение("ws_localhost_3001");
	
	СтруктураСообщения = Новый Структура("type,from,to,message","message",ИмяКлиента,ИмяПолучателя,ТекстОтправки);
	ТекстСообщения = ВебСокетыСервер.ЗаписатьДанныеВJSON(,СтруктураСообщения).Результат;	
	
	СостояниеСоединения = ВебСокет.ПолучитьСостояние();
	СостояниеОткрыто = (СостояниеСоединения = СостояниеWebSocketСоединения.Открыто); 

	Если СостояниеОткрыто Тогда 
		// отправка данных в WebSocket
		ВебСокет.ОтправитьСообщение(ТекстСообщения);   
		
		НоваяСтрока = Общение.Добавить();
		НоваяСтрока.ТекстСообщения = ?(ПустаяСтрока(ИмяПолучателя),"you → all: ", "you → "+ИмяПолучателя+": ") + ТекстОтправки;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;	
	ПараметрыЗаписи.Вставить("Сообщение", ТекстСообщения);  
	
	ВебСокетыСервер.ПриЗакрытииСоединения("ws_localhost_3001", ПараметрыЗаписи);
			
    ВидимостьДоступностьЭлементов(СостояниеОткрыто);
	
КонецПроцедуры 

Процедура ВидимостьДоступностьЭлементов(СостояниеОткрыто)
	Элементы.Группа1.Видимость = Не СостояниеОткрыто;
	Элементы.ИмяПолучателя.Видимость = СостояниеОткрыто;
	Элементы.ТекстОтправки.Видимость = СостояниеОткрыто;
    Элементы.ОтправитьСообщение.Видимость = СостояниеОткрыто;
    Элементы.Общение.Видимость = СостояниеОткрыто;
КонецПроцедуры	
