
Процедура ПередПодключением(Клиент)	 

	ЗаписьЖурналаРегистрации("WebSocket.ПередПодключением",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.WebSocketКлиенты.КлиентКонфигураторПредопределенный);
		
КонецПроцедуры

Процедура ПриОткрытииСоединения(Соединение)
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОткрытииСоединения",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.WebSocketКлиенты.КлиентКонфигураторПредопределенный);

КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение)
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриПолученииСообщения",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.WebSocketКлиенты.КлиентКонфигураторПредопределенный,,Сообщение);

КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОшибке",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.WebSocketКлиенты.КлиентКонфигураторПредопределенный,КодОшибки,Описание);

КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриЗакрытииСоединения",
		УровеньЖурналаРегистрации.Предупреждение,
		Метаданные.WebSocketКлиенты.КлиентКонфигураторПредопределенный,КодЗакрытия);
		
КонецПроцедуры


Функция Токен()
	
	token = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiYWRtaW4iOnRydWUsImlhdCI6MTUxNjIzOTAyMn0.KMUFsIDTnFmyG3nMiGM6H9FNFUROf3wh7SmqJp-QV30";
	Возврат token;
	
КонецФункции	
      