
&НаКлиенте
Процедура ПолучитьСоединения(Команда)
	
	Если Список.Количество() > 0 Тогда
		Список.Очистить();
	КонецЕсли;	
	
	Соединения = WebSocketКлиентСоединения.ПолучитьСоединения();
	Для Каждого Соединение Из Соединения Цикл 
		НоваяСтрока = Список.Добавить(); 
		НоваяСтрока.Серверный 	= Ложь;
		НоваяСтрока.Ключ 		= Соединение.Ключ;
		НоваяСтрока.URLСервера 	= Соединение.URLСервера; 		
		
		Состояние = Соединение.ПолучитьСостояние(); 
		Если Состояние = СостояниеWebSocketСоединения.Открыто Тогда 
			НоваяСтрока.Состояние = "Открыто";	
		ИначеЕсли Состояние = СостояниеWebSocketСоединения.Открывается Тогда	
			НоваяСтрока.Состояние = "Открывается";
		ИначеЕсли Состояние = СостояниеWebSocketСоединения.Закрывается Тогда
			НоваяСтрока.Состояние = "Закрывается";
		Иначе
			НоваяСтрока.Состояние = "Закрыто";	
		КонецЕсли;	
	КонецЦикла;
	
	ПолучитьСоединенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСоединенияНаСервере()
	
	Соединения = WebSocketКлиентСоединения.ПолучитьСоединения();  
	Для Каждого Соединение Из Соединения Цикл 
		НоваяСтрока = Список.Добавить(); 
		НоваяСтрока.Серверный 	= Истина;
		НоваяСтрока.Ключ 		= Соединение.Ключ;
		НоваяСтрока.URLСервера 	= Соединение.URLСервера;
		
		Состояние = Соединение.ПолучитьСостояние(); 
		Если Состояние = СостояниеWebSocketСоединения.Открыто Тогда 
			НоваяСтрока.Состояние = "Открыто";	
		ИначеЕсли Состояние = СостояниеWebSocketСоединения.Открывается Тогда	
			НоваяСтрока.Состояние = "Открывается";
		ИначеЕсли Состояние = СостояниеWebSocketСоединения.Закрывается Тогда
			НоваяСтрока.Состояние = "Закрывается";
		Иначе
			НоваяСтрока.Состояние = "Закрыто";	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСоединения(Команда) 
	
	МассивКлючейСервер = Новый Массив;
	Для Каждого ТекСтрока Из Список Цикл
		Если Не ТекСтрока.Выбранное Тогда 
			Продолжить;
		КонецЕсли;	
			
		Если ТекСтрока.Серверный Тогда 
			МассивКлючейСервер.Добавить(ТекСтрока.Ключ);
			Продолжить;
		КонецЕсли;		
			
		Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(ТекСтрока.Ключ);  
		Если Соединение <> Неопределено Тогда
			СостояниеСоединения = Соединение.ПолучитьСостояние();
			Если СостояниеСоединения = СостояниеWebSocketСоединения.Открыто Тогда 
				Соединение.Закрыть(); 
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла; 
	ЗакрытьСоединенияНаСервере(МассивКлючейСервер);
	ПолучитьСоединения(Команда);
КонецПроцедуры

&НаСервере
Процедура ЗакрытьСоединенияНаСервере(МассивКлючейСервер)
	Для Каждого элМассива Из МассивКлючейСервер Цикл			
		Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(элМассива);  
		Если Соединение <> Неопределено Тогда
			СостояниеСоединения = Соединение.ПолучитьСостояние();
			Если СостояниеСоединения = СостояниеWebSocketСоединения.Открыто Тогда 
				Соединение.Закрыть(); 
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;
КонецПроцедуры
