Процедура ПриОткрытииСоединения(Соединение)	Экспорт
	WebsocketСервер.ПриОткрытииСоединения("Клиент");
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт	
	WebsocketСервер.ПриПолученииСообщения("Клиент", Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание) Экспорт	
	WebsocketСервер.ПриОшибке("Клиент", КодОшибки, Описание);			
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия) Экспорт
	WebsocketСервер.ПриЗакрытииСоединения("Клиент", КодЗакрытия);	
КонецПроцедуры
