Процедура ПриОткрытииСоединения(Соединение) Экспорт	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОткрытииСоединения",
		УровеньЖурналаРегистрации.Информация, "Обработки.wsДинамический");
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт	
	ЗаписьЖурналаРегистрации("WebSocket.ПриПолученииСообщения",
		УровеньЖурналаРегистрации.Информация, "Обработки.wsДинамический",, Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание) Экспорт	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОшибке",
		УровеньЖурналаРегистрации.Ошибка, "Обработки.wsДинамический", КодОшибки, Описание);			
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия) Экспорт
	ЗаписьЖурналаРегистрации("WebSocket.ПриЗакрытииСоединения",
		УровеньЖурналаРегистрации.Предупреждение, "Обработки.wsДинамический", КодЗакрытия);	
КонецПроцедуры
