
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого WSКлиент Из Метаданные.WebSocketКлиенты Цикл 
		
		Элементы.СписокСокетов.СписокВыбора.Добавить(WSКлиент.Имя,WSКлиент.Имя);
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Элементы.СписокСокетов.СписокВыбора) Тогда 
		СписокСокетов = Элементы.СписокСокетов.СписокВыбора[0];	
	КонецЕсли;	
	
	СписокСокетовПриИзмененииНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокСокетовПриИзменении(Элемент)
	СписокСокетовПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокСокетовПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(СписокСокетов) тогда
		
		ВыбранныйWebSocket = Метаданные.WebSocketКлиенты[СписокСокетов];
		Адрес = ВыбранныйWebSocket.URLСервера;
		Логин = ВыбранныйWebSocket.Пользователь;
		Пароль= ВыбранныйWebSocket.Пароль;  
		
		Заголовки.Очистить();  
		ЗаголовкиМассив = Метаданные.WebSocketКлиенты[СписокСокетов].Заголовки.ВыгрузитьЗначения();
		Для Каждого текЗаголовок из ЗаголовкиМассив Цикл 
			НоваяСтрока = Заголовки.Добавить();
			НоваяСтрока.Имя = текЗаголовок.Ключ;
			НоваяСтрока.Значение = текЗаголовок.Значение;
		КонецЦикла;		
		
	Иначе
		
		Адрес = "";
		Логин = "";
		Пароль = "";
		Заголовки.Очистить();
		
	КонецЕсли;		
		
КонецПроцедуры
