Процедура ПриОткрытииСоединения(Соединение) Экспорт
	
	Если ТипЗнч(Соединение) = Тип("Строка") Тогда 
		ТипВыполнения = "Клиент";
	Иначе
		ТипВыполнения = "Сервер";
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОткрытииСоединения",
		УровеньЖурналаРегистрации.Информация, ТипВыполнения+": Обработки.wsДинамический");
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт
	
	Если ТипЗнч(Соединение) = Тип("Строка") Тогда 
		ТипВыполнения = "Клиент";
	Иначе
		ТипВыполнения = "Сервер";
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриПолученииСообщения",
		УровеньЖурналаРегистрации.Информация, ТипВыполнения+": Обработки.wsДинамический",, Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание) Экспорт
	
	Если ТипЗнч(Соединение) = Тип("Строка") Тогда 
		ТипВыполнения = "Клиент";
	Иначе
		ТипВыполнения = "Сервер";
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриОшибке",
		УровеньЖурналаРегистрации.Ошибка, ТипВыполнения+": Обработки.wsДинамический", КодОшибки, Описание);			
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия) Экспорт  
	
	Если ТипЗнч(Соединение) = Тип("Строка") Тогда 
		ТипВыполнения = "Клиент";
	Иначе
		ТипВыполнения = "Сервер";
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("WebSocket.ПриЗакрытииСоединения",
		УровеньЖурналаРегистрации.Предупреждение, ТипВыполнения+": Обработки.wsДинамический", КодЗакрытия);	
КонецПроцедуры
