
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

Процедура Команда1НаСервере()
	
	//СоединенияПоКлючу = "9f442068-bee0-4472-9376-36896c5ed5fa WebSocketКлиентTest";
	СоединенияПоКлючу = КлючСоединения;
	ВебСокет = WebSocketКлиентСоединения.ПолучитьСоединение(СоединенияПоКлючу);	
	Если ВебСокет <> Неопределено Тогда 
		ВебСокет.ОтправитьСообщение("Привет, постман! ПолучитьСоединениЕ по ключу");
	КонецЕсли;
	
	ВебСокетЫ = WebSocketКлиентСоединения.ПолучитьСоединения();
	Для Каждого ВебСокет из ВебСокетЫ Цикл
		Если ВебСокет <> Неопределено Тогда
			ВебСокет.ОтправитьСообщение("Привет, постман! ПолучитьСоединениЯ");
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

