
&НаКлиенте
Процедура Подключится(Команда)
	Если Клиент Тогда 
		КлючКлиента = "Клиент"+КлючСоединения();	

		ОбработчикиСокета = Новый ОбработчикиWebSocketКлиентСоединения;
	    ОбработчикиСокета.Модуль = "WebsocketКлиент";
	    ОбработчикиСокета.ОбработчикОткрытияСоединения = "ПриОткрытииСоединения";
	    ОбработчикиСокета.ОбработчикЗакрытияСоединения= "ПриЗакрытииСоединения";
	    ОбработчикиСокета.ОбработчикПолученияСообщения = "ПриПолученииСообщения";
	    ОбработчикиСокета.ОбработчикОшибки = "ПриОшибке";
		
		ПараметрыСокета = Новый ПараметрыWebSocketКлиентСоединения;
		ПараметрыСокета.Пользователь = Логин();
		ПараметрыСокета.Пароль = Пароль();	

	    WebSocketКлиентСоединения.ОткрытьСоединение(
			КлючКлиента, "ws://localhost:3001", ОбработчикиСокета, ПараметрыСокета);
			
	Иначе	
		ПодключитсяНаСервере();
	КонецЕсли;	
КонецПроцедуры
&НаСервере
Процедура ПодключитсяНаСервере()
	
	КлючКлиента = "Сервер"+КлючСоединения();	

	ОбработчикиСокета = Новый ОбработчикиWebSocketКлиентСоединения;
    ОбработчикиСокета.Модуль = "WebsocketСервер";
    ОбработчикиСокета.ОбработчикОткрытияСоединения = "ПриОткрытииСоединения";
    ОбработчикиСокета.ОбработчикЗакрытияСоединения= "ПриЗакрытииСоединения";
    ОбработчикиСокета.ОбработчикПолученияСообщения = "ПриПолученииСообщения";
    ОбработчикиСокета.ОбработчикОшибки = "ПриОшибке";
	
	ПараметрыСокета = Новый ПараметрыWebSocketКлиентСоединения;
	ПараметрыСокета.Пользователь = Логин();
	ПараметрыСокета.Пароль = Пароль();	

    WebSocketКлиентСоединения.ОткрытьСоединение(
		КлючКлиента, "ws://localhost:3001", ОбработчикиСокета, ПараметрыСокета);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если Клиент Тогда	
		
		Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючКлиента);  
		Если Соединение <> Неопределено Тогда 
			
			СостояниеСоединения = Соединение.ПолучитьСостояние();
			СостояниеОткрыто = (СостояниеСоединения = СостояниеWebSocketСоединения.Открыто);
			Если СостояниеОткрыто Тогда 
				Соединение.ОтправитьСообщение(Сообщение); 
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе 
		ОтправитьНаСервере();	
	КонецЕсли;	
КонецПроцедуры 
&НаСервере
Процедура ОтправитьНаСервере()
	
	Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючКлиента);   
	Если Соединение <> Неопределено Тогда 
		
		СостояниеСоединения = Соединение.ПолучитьСостояние();
		СостояниеОткрыто = (СостояниеСоединения = СостояниеWebSocketСоединения.Открыто);
		Если СостояниеОткрыто Тогда 
			Соединение.ОтправитьСообщение(Сообщение); 
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры


Функция Логин()
	Возврат "myUser";
КонецФункции

Функция Пароль()
	Возврат "123";
КонецФункции

Функция КлючСоединения() 		
	Возврат Строка(Новый УникальныйИдентификатор);
КонецФункции

