
&НаКлиенте
Процедура Подключится(Команда)
	Если Клиент Тогда 
		КлючКлиента = КлючСоединения("Клиент_");	
		//КлючКлиента = КлючСоединения();
		
		ОбработчикиСокета = Новый ОбработчикиWebSocketКлиентСоединения;
	    ОбработчикиСокета.Модуль = "WebsocketКлиент";
	    ОбработчикиСокета.ОбработчикОткрытияСоединения = "ПриОткрытииСоединения";
	    ОбработчикиСокета.ОбработчикЗакрытияСоединения= "ПриЗакрытииСоединения";
	    ОбработчикиСокета.ОбработчикПолученияСообщения = "ПриПолученииСообщения";
	    ОбработчикиСокета.ОбработчикОшибки = "ПриОшибке";
		
		ПараметрыСокета = Новый ПараметрыWebSocketКлиентСоединения;
		ПараметрыСокета.Заголовки["x-token"] = "secret123";	

	    СоединениеWS = WebSocketКлиентСоединения.ОткрытьСоединение(
			КлючКлиента, "ws://localhost:8080", ОбработчикиСокета, ПараметрыСокета);
			
	Иначе	
		ПодключитсяНаСервере();
	КонецЕсли;	
КонецПроцедуры
&НаСервере
Процедура ПодключитсяНаСервере()
	
	КлючКлиента = КлючСоединения("Сервер_");	
    //КлючКлиента = КлючСоединения();
	
	ОбработчикиСокета = Новый ОбработчикиWebSocketКлиентСоединения;
    ОбработчикиСокета.Модуль = "WebsocketСервер";
    ОбработчикиСокета.ОбработчикОткрытияСоединения = "ПриОткрытииСоединения";
    ОбработчикиСокета.ОбработчикЗакрытияСоединения= "ПриЗакрытииСоединения";
    ОбработчикиСокета.ОбработчикПолученияСообщения = "ПриПолученииСообщения";
    ОбработчикиСокета.ОбработчикОшибки = "ПриОшибке";
	
	ПараметрыСокета = Новый ПараметрыWebSocketКлиентСоединения;
	//ПараметрыСокета.Пользователь = Логин();
	//ПараметрыСокета.Пароль = Пароль();	
	ПараметрыСокета.Заголовки["x-login"] = "admin";
	ПараметрыСокета.Заголовки["x-password"] = "123";
	
    СоединениеWS = WebSocketКлиентСоединения.ОткрытьСоединение(
		КлючКлиента, "ws://localhost:8080", ОбработчикиСокета, ПараметрыСокета);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если Клиент Тогда	
		
		Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючКлиента);  
		Если Соединение <> Неопределено Тогда 
			
			СостояниеСоединения = Соединение.ПолучитьСостояние();
			СостояниеОткрыто = (СостояниеСоединения = СостояниеWebSocketСоединения.Открыто);
			Если СостояниеОткрыто Тогда 
				Соединение.ОтправитьСообщение(Сообщение); 
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе 
		ОтправитьНаСервере();	
	КонецЕсли;	
КонецПроцедуры 
&НаСервере
Процедура ОтправитьНаСервере()
	
	Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючКлиента);   
	Если Соединение <> Неопределено Тогда 
		
		СостояниеСоединения = Соединение.ПолучитьСостояние();
		СостояниеОткрыто = (СостояниеСоединения = СостояниеWebSocketСоединения.Открыто);
		Если СостояниеОткрыто Тогда 
			Соединение.ОтправитьСообщение(Сообщение); 
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Функция КлючСоединения(ТипКлюча="")
	Возврат ТипКлюча+Строка(Новый УникальныйИдентификатор); 
	//Возврат ТипКлюча+"ЯУникальныйКлюч";
КонецФункции

